[
  {
    "name": "Day 1",
    "theme": "Resurrection Joy",
    "scripture_passage": "John 20:1 - 'Early on the first day of the week, while it was still dark, Mary Magdalene went to the tomb and saw that the stone had been removed from the entrance.'",
    "reflection": "The empty tomb is the foundation of our faith. Christ is risen, bringing joy to the world. Reflect on the hope this brings to your life.",
    "prayer": "Risen Lord, fill my heart with the joy of Your resurrection. May I live in the light of Your victory over death. Amen.",
    "activity": "Visit a church or garden to reflect on the resurrection, or share the Easter story with a friend.",
    "youtube_link": "https://www.youtube.com/embed/bkA9LgEU3Vo"
  },
  {
    "name": "Day 2",
    "theme": "Resurrection Joy",
    "scripture_passage": "Luke 24:5-6 - 'Why do you look for the living among the dead? He is not here; he has risen!'",
    "reflection": "The angels' words remind us that Jesus is alive. Let this truth renew your spirit today.",
    "prayer": "Lord, thank You for conquering death. Help me to seek You, the living God, in all I do. Amen.",
    "activity": "Write a letter of gratitude to God for the gift of eternal life.",
    "youtube_link": "https://www.youtube.com/embed/zwe3XGi9mMY"
  },
  {
    "name": "Day 3",
    "theme": "Resurrection Joy",
    "scripture_passage": "Matthew 28:8 - 'So the women hurried away from the tomb, afraid yet filled with joy, and ran to tell his disciples.'",
    "reflection": "The women's joy was contagious as they shared the good news. How can you share Christ's joy with others?",
    "prayer": "Jesus, let my life reflect the joy of Your resurrection. Use me to share Your love with others. Amen.",
    "activity": "Call or visit someone to share a message of hope and joy.",
    "youtube_link": "https://www.youtube.com/embed/wYsCGu7Q8oA"
  },
  {
    "name": "Day 4",
    "theme": "Resurrection Joy",
    "scripture_passage": "John 20:11-12 - 'Now Mary stood outside the tomb crying. As she wept, she bent over to look into the tomb and saw two angels in white, seated where Jesus' body had been.'",
    "reflection": "Even in our sorrow, Jesus meets us with His presence. Trust that He is near, bringing joy to your heart.",
    "prayer": "Lord, comfort me in my struggles and fill me with the joy of Your resurrection. Amen.",
    "activity": "Light a candle as a symbol of Christ's light overcoming darkness.",
    "youtube_link": "https://www.youtube.com/embed/rHp0oIzDwVw"
  },
  {
    "name": "Day 5",
    "theme": "Resurrection Joy",
    "scripture_passage": "John 20:16 - 'Jesus said to her, “Mary.” She turned toward him and cried out in Aramaic, “Rabboni!” (which means “Teacher”).'",
    "reflection": "Jesus calls us by name, just as He called Mary. He knows you personally and loves you deeply.",
    "prayer": "Risen Savior, thank You for knowing me and calling me by name. Let me hear Your voice today. Amen.",
    "activity": "Write your name in a journal and reflect on how Jesus knows and loves you.",
    "youtube_link": "https://www.youtube.com/embed/5Zfu0eG_mYo"
  },
  {
    "name": "Day 6",
    "theme": "Resurrection Joy",
    "scripture_passage": "Matthew 28:9 - 'Suddenly Jesus met them. “Greetings,” he said. They came to him, clasped his feet and worshiped him.'",
    "reflection": "Meeting the risen Christ leads to worship. Take time to adore Him for His victory over death.",
    "prayer": "Lord, I worship You for Your resurrection power. You are worthy of all praise. Amen.",
    "activity": "Sing or listen to a worship song celebrating the resurrection, like 'Christ the Lord Is Risen Today.'",
    "youtube_link": "https://www.youtube.com/embed/pWylS4z5dW8"
  },
  {
    "name": "Day 7",
    "theme": "Resurrection Joy",
    "scripture_passage": "Luke 24:12 - 'Peter, however, got up and ran to the tomb. Bending over, he saw the strips of linen lying by themselves, and he went away, wondering to himself what had happened.'",
    "reflection": "Peter's wonder reminds us to approach the resurrection with awe. Let this mystery deepen your faith.",
    "prayer": "Father, fill me with wonder at the miracle of the resurrection. Strengthen my faith in You. Amen.",
    "activity": "Take a walk and marvel at signs of new life in nature, reflecting on Christ's resurrection.",
    "youtube_link": "https://www.youtube.com/embed/zywAwHR2vT8"
  },
  {
    "name": "Day 8",
    "theme": "Resurrection Joy",
    "scripture_passage": "John 20:18 - 'Mary Magdalene went to the disciples with the news: “I have seen the Lord!” And she told them that he had said these things to her.'",
    "reflection": "Mary became the first to proclaim the resurrection. Share the good news of Christ's victory today.",
    "prayer": "Lord, give me boldness to share the good news of Your resurrection with others. Amen.",
    "activity": "Share a post on social media about the joy of Easter and what it means to you.",
    "youtube_link": "https://www.youtube.com/embed/lIgVU9llytM"
  },
  {
    "name": "Day 9",
    "theme": "Resurrection Joy",
    "scripture_passage": "1 Corinthians 15:20 - 'But Christ has indeed been raised from the dead, the firstfruits of those who have fallen asleep.'",
    "reflection": "Christ's resurrection is the promise of our own. Rejoice in the hope of eternal life.",
    "prayer": "Jesus, thank You for being the firstfruits of resurrection. I look forward to eternal life with You. Amen.",
    "activity": "Create a small artwork (e.g., a drawing of a sunrise) symbolizing resurrection hope.",
    "youtube_link": "https://www.youtube.com/embed/VaFZc8bckuY"
  },
  {
    "name": "Day 10",
    "theme": "Resurrection Joy",
    "scripture_passage": "Psalm 30:5 - 'Weeping may stay for the night, but rejoicing comes in the morning.'",
    "reflection": "The resurrection turns our mourning into joy. Let Christ's victory bring light to your darkness.",
    "prayer": "Lord, turn my sorrow into joy as I celebrate Your resurrection. Be my light today. Amen.",
    "activity": "Watch the sunrise and pray, thanking God for the joy that follows sorrow.",
    "youtube_link": "https://www.youtube.com/embed/wpun5p2GdHU"
  },
  {
    "name": "Day 11",
    "theme": "New Life",
    "scripture_passage": "Romans 6:4 - 'We were therefore buried with him through baptism into death in order that, just as Christ was raised from the dead through the glory of the Father, we too may live a new life.'",
    "reflection": "Christ's resurrection gives us new life. Consider how you can live out this newness in your daily actions.",
    "prayer": "Father, thank You for the new life I have in Christ. Guide me to walk in Your ways. Amen.",
    "activity": "Plant a seed or flower as a symbol of new life and growth.",
    "youtube_link": "https://www.youtube.com/embed/vpRoosQZh1s"
  },
  {
    "name": "Day 12",
    "theme": "New Life",
    "scripture_passage": "2 Corinthians 5:17 - 'Therefore, if anyone is in Christ, the new creation has come: The old has gone, the new is here!'",
    "reflection": "In Christ, we are made new. Let go of the old and embrace the transformation He offers.",
    "prayer": "Lord, make me a new creation in You. Help me to let go of the past and embrace Your future for me. Amen.",
    "activity": "Declutter a small space in your home as a physical act of letting go of the old.",
    "youtube_link": "https://www.youtube.com/embed/6S9ERMNpg7o"
  },
  {
    "name": "Day 13",
    "theme": "New Life",
    "scripture_passage": "Colossians 3:1 - 'Since, then, you have been raised with Christ, set your hearts on things above, where Christ is, seated at the right hand of God.'",
    "reflection": "Our new life in Christ calls us to focus on heavenly things. Fix your heart on Him today.",
    "prayer": "Jesus, help me to set my heart on You and the things above. Renew my focus. Amen.",
    "activity": "Spend 10 minutes in prayer, focusing on God's eternal promises.",
    "youtube_link": "https://www.youtube.com/embed/vOzdFjbZ11c"
  },
  {
    "name": "Day 14",
    "theme": "New Life",
    "scripture_passage": "Ephesians 4:22-24 - 'You were taught... to put on the new self, created to be like God in true righteousness and holiness.'",
    "reflection": "New life means becoming more like Christ. Seek to reflect His righteousness and holiness today.",
    "prayer": "Lord, help me to put on my new self and reflect Your character in all I do. Amen.",
    "activity": "Perform an act of kindness that reflects Christ's love and holiness.",
    "youtube_link": "https://www.youtube.com/embed/AIqfd_Umlz0"
  },
  {
    "name": "Day 15",
    "theme": "New Life",
    "scripture_passage": "Isaiah 43:19 - 'See, I am doing a new thing! Now it springs up; do you not perceive it?'",
    "reflection": "God is always at work, bringing newness. Open your eyes to the new things He is doing in your life.",
    "prayer": "Father, open my eyes to the new things You are doing. Let me embrace Your work in my life. Amen.",
    "activity": "Journal about a new thing God is doing in your life or a new perspective you've gained.",
    "youtube_link": "https://www.youtube.com/embed/mR54EVSvmUk"
  },
  {
    "name": "Day 16",
    "theme": "New Life",
    "scripture_passage": "Galatians 2:20 - 'I have been crucified with Christ and I no longer live, but Christ lives in me.'",
    "reflection": "New life means Christ living in us. Surrender to His presence and let Him guide your actions.",
    "prayer": "Jesus, live in me and through me. Let my life reflect Your love and grace. Amen.",
    "activity": "Spend time in silence, inviting Christ to fill you with His presence.",
    "youtube_link": "https://www.youtube.com/embed/1f8lVfBXBYw"
  },
  {
    "name": "Day 17",
    "theme": "New Life",
    "scripture_passage": "1 Peter 1:3 - 'In his great mercy he has given us new birth into a living hope through the resurrection of Jesus Christ from the dead.'",
    "reflection": "Our new birth comes through Christ's resurrection. Rejoice in the living hope we have in Him.",
    "prayer": "Lord, thank You for the living hope of new birth. Fill me with Your mercy and grace. Amen.",
    "activity": "Write a prayer of thanks for the hope you have in Christ and share it with a friend.",
    "youtube_link": "https://www.youtube.com/embed/KEUwsbTcEvg"
  },
  {
    "name": "Day 18",
    "theme": "New Life",
    "scripture_passage": "Revelation 21:5 - 'He who was seated on the throne said, “I am making everything new!”'",
    "reflection": "Christ's resurrection is the beginning of God's renewal of all things. Trust in His promise to make all things new.",
    "prayer": "Lord, I trust in Your promise to make all things new. Renew my heart and my life. Amen.",
    "activity": "Create a vision board or drawing of what “new” looks like in your spiritual life.",
    "youtube_link": "https://www.youtube.com/embed/xvwBsNYShm0"
  },
  {
    "name": "Day 19",
    "theme": "New Life",
    "scripture_passage": "Titus 3:5 - 'He saved us through the washing of rebirth and renewal by the Holy Spirit.'",
    "reflection": "The Holy Spirit brings renewal to our lives. Invite the Spirit to work in you today.",
    "prayer": "Holy Spirit, wash and renew me. Fill me with Your life-giving presence. Amen.",
    "activity": "Take a refreshing walk and pray for the Holy Spirit's renewal in your life.",
    "youtube_link": "https://www.youtube.com/embed/tjhUbSziuhw"
  },
  {
    "name": "Day 20",
    "theme": "New Life",
    "scripture_passage": "Lamentations 3:22-23 - 'Because of the Lord's great love we are not consumed, for his compassions never fail. They are new every morning.'",
    "reflection": "God's mercies are new every morning. Start this day with a fresh sense of His love and grace.",
    "prayer": "Lord, thank You for Your new mercies today. Let me experience Your love afresh. Amen.",
    "activity": "Begin your day with a prayer of gratitude for God's fresh mercies.",
    "youtube_link": "https://www.youtube.com/embed/VZwAEU6bgrU"
  },
  {
    "name": "Day 21",
    "theme": "Christ's Appearances",
    "scripture_passage": "Luke 24:13-15 - 'Now that same day two of them were going to a village called Emmaus... Jesus himself came up and walked along with them.'",
    "reflection": "Jesus walks with us, even when we don't recognize Him. Look for His presence in your journey today.",
    "prayer": "Lord, open my eyes to see You walking with me, just as You did with the disciples. Amen.",
    "activity": "Take a walk and imagine Jesus walking beside you, speaking to your heart.",
    "youtube_link": "https://www.youtube.com/embed/QFBVs9_tBbk"
  },
  {
    "name": "Day 22",
    "theme": "Christ's Appearances",
    "scripture_passage": "Luke 24:30-31 - 'When he was at the table with them, he took bread, gave thanks, broke it and began to give it to them. Then their eyes were opened and they recognized him.'",
    "reflection": "Jesus reveals Himself in the breaking of bread. Seek Him in the Eucharist or in shared meals.",
    "prayer": "Jesus, reveal Yourself to me in the breaking of bread. Let me know You more deeply. Amen.",
    "activity": "Share a meal with family or friends and give thanks for Christ's presence.",
    "youtube_link": "https://www.youtube.com/embed/9krV99OBYbA"
  },
  {
    "name": "Day 23",
    "theme": "Christ's Appearances",
    "scripture_passage": "John 20:19 - 'On the evening of that first day of the week, when the disciples were together, with the doors locked for fear of the Jewish leaders, Jesus came and stood among them and said, “Peace be with you!”'",
    "reflection": "Jesus brings peace to our fears. Let His presence calm your heart today.",
    "prayer": "Risen Lord, speak peace into my fears. Let me rest in Your presence. Amen.",
    "activity": "Write down a fear you're facing and pray for Christ's peace over it.",
    "youtube_link": "https://www.youtube.com/embed/Bp31lVlcS10"
  },
  {
    "name": "Day 24",
    "theme": "Christ's Appearances",
    "scripture_passage": "John 20:27 - 'Then he said to Thomas, “Put your finger here; see my hands. Reach out your hand and put it into my side. Stop doubting and believe.”'",
    "reflection": "Jesus meets us in our doubts, offering proof of His resurrection. Bring your doubts to Him today.",
    "prayer": "Lord, help me to believe even when I doubt. Show me Your wounds and Your love. Amen.",
    "activity": "Journal about a doubt you have and ask Jesus to meet you in it.",
    "youtube_link": "https://www.youtube.com/embed/QVqNyp65z74"
  },
  {
    "name": "Day 25",
    "theme": "Christ's Appearances",
    "scripture_passage": "John 21:4 - 'Early in the morning, Jesus stood on the shore, but the disciples did not realize that it was Jesus.'",
    "reflection": "Jesus often appears in unexpected ways. Be open to encountering Him in the ordinary moments of life.",
    "prayer": "Jesus, help me to recognize You in the everyday moments of my life. Amen.",
    "activity": "Look for a small sign of Christ's presence today (e.g., in nature, a conversation, or a kind act).",
    "youtube_link": "https://www.youtube.com/embed/D48_kaNqwpk"
  },
  {
    "name": "Day 26",
    "theme": "Christ's Appearances",
    "scripture_passage": "John 21:12 - 'Jesus said to them, “Come and have breakfast.” None of the disciples dared ask him, “Who are you?” They knew it was the Lord.'",
    "reflection": "Jesus provides for us, even in the simple act of sharing a meal. Trust in His provision for your needs.",
    "prayer": "Lord, thank You for providing for me. Let me trust in Your care and provision. Amen.",
    "activity": "Prepare a simple breakfast and thank Jesus for His provision as you eat.",
    "youtube_link": "https://www.youtube.com/embed/Gea6VsANS4w"
  },
  {
    "name": "Day 27",
    "theme": "Christ's Appearances",
    "scripture_passage": "Luke 24:36 - 'While they were still talking about this, Jesus himself stood among them and said to them, “Peace be with you.”'",
    "reflection": "Jesus' presence brings peace to our conversations and gatherings. Invite Him into your interactions today.",
    "prayer": "Jesus, bring Your peace into my conversations and relationships. Be present with me. Amen.",
    "activity": "Pray for peace before a conversation or meeting today.",
    "youtube_link": "https://www.youtube.com/embed/3A05cJXPtoY"
  },
  {
    "name": "Day 28",
    "theme": "Christ's Appearances",
    "scripture_passage": "John 20:29 - 'Then Jesus told him, “Because you have seen me, you have believed; blessed are those who have not seen and yet have believed.”'",
    "reflection": "We are blessed for believing in Christ without seeing Him. Let this strengthen your faith today.",
    "prayer": "Lord, bless me as I believe in You without seeing. Deepen my faith in Your resurrection. Amen.",
    "activity": "Share a testimony of how you've believed in Christ even without seeing Him.",
    "youtube_link": "https://www.youtube.com/embed/ptgLM7ZVWLE"
  },
  {
    "name": "Day 29",
    "theme": "Christ's Appearances",
    "scripture_passage": "John 21:15 - 'When they had finished eating, Jesus said to Simon Peter, “Simon son of John, do you love me more than these?”'",
    "reflection": "Jesus restores us, just as He restored Peter. Reflect on how His love calls you to love Him more.",
    "prayer": "Jesus, I love You. Restore me and help me to love You more each day. Amen.",
    "activity": "Write a letter to Jesus expressing your love for Him.",
    "youtube_link": "https://www.youtube.com/embed/gGEyfiY7w"
  },
  {
    "name": "Day 30",
    "theme": "Christ's Appearances",
    "scripture_passage": "Matthew 28:19-20 - 'Therefore go and make disciples of all nations... And surely I am with you always, to the very end of the age.'",
    "reflection": "Jesus promises to be with us always as we share His love. Trust in His presence as you live out His mission.",
    "prayer": "Lord, thank You for being with me always. Help me to share Your love with others. Amen.",
    "activity": "Reach out to someone with a kind word or deed, sharing Christ's love.",
    "youtube_link": "https://www.youtube.com/embed/65MwQ9yPdIc"
  },
  {
    "name": "Day 31",
    "theme": "Ascension",
    "scripture_passage": "Acts 1:3 - 'After his suffering, he presented himself to them and gave many convincing proofs that he was alive. He appeared to them over a period of forty days.'",
    "reflection": "Jesus spent 40 days preparing His disciples for His Ascension. Reflect on how He prepares you for His mission.",
    "prayer": "Jesus, prepare my heart for Your mission as You prepared Your disciples. Amen.",
    "activity": "Read Acts 1 and journal about how Jesus is preparing you for His work.",
    "youtube_link": "https://www.youtube.com/embed/EbG0NJnwOc4"
  },
  {
    "name": "Day 32",
    "theme": "Ascension",
    "scripture_passage": "Luke 24:50 - 'When he had led them out to the vicinity of Bethany, he lifted up his hands and blessed them.'",
    "reflection": "Jesus blesses us as He ascends. Receive His blessing and let it guide your life.",
    "prayer": "Lord, thank You for Your blessing as You ascended. Let it fill my life with purpose. Amen.",
    "activity": "Pray for God's blessing over your family or community today.",
    "youtube_link": "https://www.youtube.com/embed/vweT6GDbHDE"
  },
  {
    "name": "Day 33",
    "theme": "Ascension",
    "scripture_passage": "Acts 1:8 - 'But you will receive power when the Holy Spirit comes on you; and you will be my witnesses in Jerusalem, and in all Judea and Samaria, and to the ends of the earth.'",
    "reflection": "Jesus promises the Holy Spirit before ascending. Trust in the Spirit's power to make you a witness.",
    "prayer": "Jesus, thank You for the promise of the Holy Spirit. Empower me to be Your witness. Amen.",
    "activity": "Share a story of faith with someone, trusting the Spirit to guide you.",
    "youtube_link": "https://www.youtube.com/embed/Y3smvE0ecYw"
  },
  {
    "name": "Day 34",
    "theme": "Ascension",
    "scripture_passage": "Acts 1:9 - 'After he said this, he was taken up before their very eyes, and a cloud hid him from their sight.'",
    "reflection": "The Ascension marks Christ's return to heaven. Look to Him, seated at the right hand of the Father.",
    "prayer": "Lord, I look to You in heaven. Let Your glory guide my life on earth. Amen.",
    "activity": "Look up at the sky and pray, imagining Christ ascending to the Father.",
    "youtube_link": "https://www.youtube.com/embed/b8qX-P6B1rQ"
  },
  {
    "name": "Day 35",
    "theme": "Ascension",
    "scripture_passage": "Mark 16:19 - 'After the Lord Jesus had spoken to them, he was taken up into heaven and he sat at the right hand of God.'",
    "reflection": "Jesus reigns in heaven, interceding for us. Trust in His authority and care for you.",
    "prayer": "Jesus, thank You for interceding for me at the Father's right hand. I trust in Your reign. Amen.",
    "activity": "Write a prayer asking Jesus to intercede for a specific need in your life.",
    "youtube_link": "https://www.youtube.com/embed/SMU16RKfmuA"
  },
  {
    "name": "Day 36",
    "theme": "Ascension",
    "scripture_passage": "Ephesians 1:20-21 - 'He raised Christ from the dead and seated him at his right hand in the heavenly realms, far above all rule and authority.'",
    "reflection": "Christ's Ascension confirms His authority over all things. Surrender to His lordship today.",
    "prayer": "Lord, You are above all. I surrender my life to Your authority and love. Amen.",
    "activity": "Make a list of areas in your life where you need to surrender to Christ's authority.",
    "youtube_link": "https://www.youtube.com/embed/hDDpv_gKX_o"
  },
  {
    "name": "Day 37",
    "theme": "Ascension",
    "scripture_passage": "Hebrews 4:14 - 'Therefore, since we have a great high priest who has ascended into heaven, Jesus the Son of God, let us hold firmly to the faith we profess.'",
    "reflection": "Jesus, our high priest, has ascended to heaven. Hold fast to your faith in Him.",
    "prayer": "Jesus, my high priest, help me to hold firmly to my faith in You. Amen.",
    "activity": "Reflect on a time when your faith was strengthened and thank God for it.",
    "youtube_link": "https://www.youtube.com/embed/vCGUKS8iBtU"
  },
  {
    "name": "Day 38",
    "theme": "Ascension",
    "scripture_passage": "Acts 1:11 - '“Men of Galilee,” they said, “why do you stand here looking into the sky? This same Jesus, who has been taken from you into heaven, will come back in the same way you have seen him go.”'",
    "reflection": "The Ascension points to Christ's return. Live with the hope of His second coming.",
    "prayer": "Lord, I look forward to Your return. Help me to live with hope and readiness. Amen.",
    "activity": "Pray for Christ's return and for the strength to live faithfully until that day.",
    "youtube_link": "https://www.youtube.com/embed/rj8I3u-TUXQ"
  },
  {
    "name": "Day 39",
    "theme": "Ascension",
    "scripture_passage": "Colossians 3:2 - 'Set your minds on things above, not on earthly things.'",
    "reflection": "The Ascension calls us to focus on heavenly things. Fix your mind on Christ today.",
    "prayer": "Jesus, help me to set my mind on things above. Let my thoughts honor You. Amen.",
    "activity": "Spend time in worship, focusing on Christ's heavenly reign.",
    "youtube_link": "https://www.youtube.com/embed/XMIUIFQOHsY"
  },
  {
    "name": "Day 40",
    "theme": "Ascension",
    "scripture_passage": "Luke 24:52-53 - 'Then they worshiped him and returned to Jerusalem with great joy. And they stayed continually at the temple, praising God.'",
    "reflection": "The disciples responded to the Ascension with joy and worship. Celebrate Christ's reign with praise today.",
    "prayer": "Lord, I worship You with joy for Your Ascension. Let my life be a continual praise to You. Amen.",
    "activity": "Spend time praising God through song or prayer, celebrating the Ascension.",
    "youtube_link": "https://www.youtube.com/embed/mHa9atI3gN4"
  },
  {
    "name": "Day 41",
    "theme": "Holy Spirit",
    "scripture_passage": "John 14:16-17 - 'And I will ask the Father, and he will give you another advocate to help you and be with you forever—the Spirit of truth.'",
    "reflection": "Jesus promised the Holy Spirit as our advocate. Invite the Spirit to guide you as we approach Pentecost.",
    "prayer": "Holy Spirit, be my advocate and guide. Fill me with Your truth and presence. Amen.",
    "activity": "Pray for the Holy Spirit to fill you with wisdom and guidance today.",
    "youtube_link": "https://www.youtube.com/embed/iiBFMuigcD4"
  },
  {
    "name": "Day 42",
    "theme": "Holy Spirit",
    "scripture_passage": "John 16:13 - 'But when he, the Spirit of truth, comes, he will guide you into all the truth.'",
    "reflection": "The Holy Spirit leads us into truth. Trust Him to guide your decisions and understanding.",
    "prayer": "Spirit of truth, guide me into all truth. Help me to discern Your voice. Amen.",
    "activity": "Read a passage of Scripture and ask the Holy Spirit to reveal its truth to you.",
    "youtube_link": "https://www.youtube.com/embed/JQtDGKsTPRQ"
  },
  {
    "name": "Day 43",
    "theme": "Holy Spirit",
    "scripture_passage": "Acts 1:4-5 - '“Do not leave Jerusalem, but wait for the gift my Father promised, which you have heard me speak about. For John baptized with water, but in a few days you will be baptized with the Holy Spirit.”'",
    "reflection": "The disciples waited for the Holy Spirit. Prepare your heart for Pentecost by waiting on God.",
    "prayer": "Lord, help me to wait on You as I prepare for the gift of Your Spirit. Amen.",
    "activity": "Spend 10 minutes in silent prayer, waiting on the Holy Spirit.",
    "youtube_link": "https://www.youtube.com/embed/rT-RhKUDjVI"
  },
  {
    "name": "Day 44",
    "theme": "Holy Spirit",
    "scripture_passage": "Romans 8:26 - 'In the same way, the Spirit helps us in our weakness. We do not know what we ought to pray for, but the Spirit himself intercedes for us.'",
    "reflection": "The Holy Spirit intercedes for us in our weakness. Let Him pray through you today.",
    "prayer": "Holy Spirit, intercede for me in my weakness. Pray through me according to God's will. Amen.",
    "activity": "Pray in silence, allowing the Holy Spirit to intercede for your needs.",
    "youtube_link": "https://www.youtube.com/embed/sUZEw-vYEU4"
  },
  {
    "name": "Day 45",
    "theme": "Holy Spirit",
    "scripture_passage": "Galatians 5:22-23 - 'But the fruit of the Spirit is love, joy, peace, forbearance, kindness, goodness, faithfulness, gentleness and self-control.'",
    "reflection": "The Holy Spirit produces fruit in our lives. Reflect on how you can grow in these qualities.",
    "prayer": "Holy Spirit, produce Your fruit in my life. Help me to grow in love, joy, and peace. Amen.",
    "activity": "Choose one fruit of the Spirit to focus on today and practice it intentionally.",
    "youtube_link": "https://www.youtube.com/embed/7FrE1KOO29w"
  },
  {
    "name": "Day 46",
    "theme": "Holy Spirit",
    "scripture_passage": "1 Corinthians 12:4 - 'There are different kinds of gifts, but the same Spirit distributes them.'",
    "reflection": "The Holy Spirit gives us gifts for God's work. Seek to discover and use your spiritual gifts.",
    "prayer": "Holy Spirit, reveal the gifts You've given me and help me to use them for God's glory. Amen.",
    "activity": "Reflect on your spiritual gifts and how you can use them to serve others.",
    "youtube_link": "https://www.youtube.com/embed/qHXDvByCSvo"
  },
  {
    "name": "Day 47",
    "theme": "Holy Spirit",
    "scripture_passage": "Ephesians 5:18 - 'Do not get drunk on wine, which leads to debauchery. Instead, be filled with the Spirit.'",
    "reflection": "Being filled with the Spirit brings life and joy. Ask the Holy Spirit to fill you afresh today.",
    "prayer": "Holy Spirit, fill me afresh today. Let Your presence overflow in my life. Amen.",
    "activity": "Sing a song of worship, inviting the Holy Spirit to fill you.",
    "youtube_link": "https://www.youtube.com/embed/jxICSHGdNSM"
  },
  {
    "name": "Day 48",
    "theme": "Holy Spirit",
    "scripture_passage": "Acts 2:1-2 - 'When the day of Pentecost came, they were all together in one place. Suddenly a sound like the blowing of a violent wind came from heaven.'",
    "reflection": "Pentecost is near, and the Holy Spirit is coming in power. Prepare your heart for His arrival.",
    "prayer": "Lord, prepare my heart for the coming of Your Spirit at Pentecost. Fill me with expectation. Amen.",
    "activity": "Create a small symbol of wind or fire (e.g., a drawing) to represent the Holy Spirit.",
    "youtube_link": "https://www.youtube.com/embed/4Vt4DAt-rpQ"
  },
  {
    "name": "Day 49",
    "theme": "Holy Spirit",
    "scripture_passage": "Acts 2:3-4 - 'They saw what seemed to be tongues of fire that separated and came to rest on each of them. All of them were filled with the Holy Spirit.'",
    "reflection": "The Holy Spirit came at Pentecost with power. Ask for a fresh filling of the Spirit in your life.",
    "prayer": "Holy Spirit, come upon me with power. Fill me and use me for Your glory. Amen.",
    "activity": "Pray with a friend or family member for a fresh filling of the Holy Spirit.",
    "youtube_link": "https://www.youtube.com/embed/32SiVdCoI88"
  },
  {
    "name": "Day 50",
    "theme": "Holy Spirit",
    "scripture_passage": "Acts 2:17 - '“In the last days, God says, I will pour out my Spirit on all people. Your sons and daughters will prophesy, your young men will see visions, your old men will dream dreams.”'",
    "reflection": "Pentecost fulfills God's promise to pour out His Spirit. Celebrate the Spirit's work in the Church and in your life.",
    "prayer": "Father, thank You for pouring out Your Spirit at Pentecost. Let Your Spirit continue to work in me. Amen.",
    "activity": "Celebrate Pentecost by gathering with others to pray, worship, and give thanks for the Holy Spirit.",
    "youtube_link": "https://www.youtube.com/embed/3_UVj10Bp5s"
  }
]